# Curve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..Curve Property
StructuralElementDefinitionData Class See Also
---
The definition curve of the element.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Curve Curve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ Curve {
	Curve^ get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace